   - [#   1] COI script_q1: 
--------------------------------------------------------------------------------
  1: 
  2: def search(x, seq):
  3:     for i in range(len(seq)):
- 4:         if x <= seq[i]:
+ 4:         if not (x <= seq[i]):
  5:             return i
  6:     return len(seq)
--------------------------------------------------------------------------------
[0.01014 s] survived

   - [#   2] ROR script_q1: 
--------------------------------------------------------------------------------
  1: 
  2: def search(x, seq):
  3:     for i in range(len(seq)):
- 4:         if x <= seq[i]:
+ 4:         if x >= seq[i]:
  5:             return i
  6:     return len(seq)
--------------------------------------------------------------------------------
[0.00735 s] survived

   - [#   3] ROR script_q1: 
--------------------------------------------------------------------------------
  1: 
  2: def search(x, seq):
  3:     for i in range(len(seq)):
- 4:         if x <= seq[i]:
+ 4:         if x < seq[i]:
  5:             return i
  6:     return len(seq)
--------------------------------------------------------------------------------
[0.00735 s] survived
