   - [#   2] ASR script_q2: 
--------------------------------------------------------------------------------
  11: def unique_month(month, possible_birthdays):
  12:     count = 0
  13:     for birthday in possible_birthdays:
  14:         if birthday[0] == month:
- 15:             count += 1
+ 15:             count -= 1
  16:     return count == 1
  17: 
  18: 
  19: def contains_unique_day(month, possible_birthdays):
--------------------------------------------------------------------------------
b'\x15\xd6\xc2\x7f3`t\x16\x1c\xe8\xaa\xdd\xe7\xc2\x18\xcfJ/\x06t'
[0.00617 s] survived

   - [#   4] COI script_q2: 
--------------------------------------------------------------------------------
  10: 
  11: def unique_month(month, possible_birthdays):
  12:     count = 0
  13:     for birthday in possible_birthdays:
- 14:         if birthday[0] == month:
+ 14:         if not (birthday[0] == month):
  15:             count += 1
  16:     return count == 1
  17: 
  18: 
--------------------------------------------------------------------------------
b'\x15\xd6\xc2\x7f3`t\x16\x1c\xe8\xaa\xdd\xe7\xc2\x18\xcfJ/\x06t'
[0.00856 s] survived

   - [#   6] LCR script_q2: 
--------------------------------------------------------------------------------
  17: 
  18: 
  19: def contains_unique_day(month, possible_birthdays):
  20:     for birthday in possible_birthdays:
- 21:         if (birthday[0] == month and unique_day(birthday[1], possible_birthdays)):
+ 21:         if (birthday[0] == month or unique_day(birthday[1], possible_birthdays)):
  22:             return True
  23:     return False
  24: 
  25: 
--------------------------------------------------------------------------------
b'\x15\xd6\xc2\x7f3`t\x16\x1c\xe8\xaa\xdd\xe7\xc2\x18\xcfJ/\x06t'
[0.00476 s] survived

   - [#   9] ROR script_q2: 
--------------------------------------------------------------------------------
  10: 
  11: def unique_month(month, possible_birthdays):
  12:     count = 0
  13:     for birthday in possible_birthdays:
- 14:         if birthday[0] == month:
+ 14:         if birthday[0] != month:
  15:             count += 1
  16:     return count == 1
  17: 
  18: 
--------------------------------------------------------------------------------
b'\x15\xd6\xc2\x7f3`t\x16\x1c\xe8\xaa\xdd\xe7\xc2\x18\xcfJ/\x06t'
[0.00517 s] survived

   - [#  10] ROR script_q2: 
--------------------------------------------------------------------------------
  12:     count = 0
  13:     for birthday in possible_birthdays:
  14:         if birthday[0] == month:
  15:             count += 1
- 16:     return count == 1
+ 16:     return count != 1
  17: 
  18: 
  19: def contains_unique_day(month, possible_birthdays):
  20:     for birthday in possible_birthdays:
--------------------------------------------------------------------------------
b'\x15\xd6\xc2\x7f3`t\x16\x1c\xe8\xaa\xdd\xe7\xc2\x18\xcfJ/\x06t'
[0.00594 s] survived
