   - [#   1] COD script_q3: 
--------------------------------------------------------------------------------
  2: 
  3: def remove_extras(lst):
  4:     newlist = []
  5:     for i in lst:
- 6:         if i not in newlist:
+ 6:         if i in newlist:
  7:             newlist.append(i)
  8:     return newlist
--------------------------------------------------------------------------------
[0.00576 s] survived

   - [#   2] COI script_q3: 
--------------------------------------------------------------------------------
  2: 
  3: def remove_extras(lst):
  4:     newlist = []
  5:     for i in lst:
- 6:         if i not in newlist:
+ 6:         if not (i not in newlist):
  7:             newlist.append(i)
  8:     return newlist
--------------------------------------------------------------------------------
[0.00614 s] survived
